## pandas入门

In [1]:
#我们将使用这样得约定引入pandas
import pandas as pd
import numpy as np

### pandas的数据结构介绍
#### Series

Series是一种类似于一维数组的对象，它由一组数据（各种NumPy数据类型）以
及一组与之相关的数据标签（即索引）组成。

In [4]:
#Series的字符串表现形式为：索引在左边，值在右边。
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
#你可以通过Series 的values和index属性获取其数组表示形式和索引对象
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
#通常，我们希望所创建的Series带有一个可以对各个数据点进行标记的索引
obj2 = pd.Series([4,7,-5,3], index=('a','b','c','d'))
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [8]:
#与普通NumPy数组相比，你可以通过索引的方式选取Series中的单个或一组值
obj2['a']

4

In [11]:
obj2[['a','b','c']] #多个的话注意方括号内传入的是个一个列表

a    4
b    7
c   -5
dtype: int64

In [12]:
#根据布尔形数组进行过滤
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

In [13]:
#标量乘法
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

In [16]:
#应用数学函数
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [17]:
#如果数据被存放在一个Python字典中，也可以直接通过这个字典来创建Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
#如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）。
#你可以传入排好序的字典的键以改变顺序
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
#我将使用缺失（missing）或NA表示缺失数据。
#pandas的isnull和notnull函数可用于检测缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
#Series也有类似的实例方法
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy
数组组成的字典

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame #结果DataFrame会自动加上索引（跟Series一样），且全部列会被有序排列

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
#对于特别大的DataFrame，head方法会选取前五行
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
#如果指定了列序列，则DataFrame的列就会按照指定顺序进行排列:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [25]:
#如果传入的列在数据中找不到，就会在结果中产生缺失值
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
#注意，返回的Series拥有原DataFrame相同的索引，且其name属性也已经被相应地设置好了
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [31]:
#行也可以通过位置或名称的方式进行获取，比如用loc属性
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
#列可以通过赋值的方式进行修改
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [34]:
#将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配
#如果赋值的是一个Series，就会精确匹配DataFrame的索引
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
#为不存在的列赋值会创建出一个新列
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [37]:
#del方法可以用来删除这列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

注意：通过索引方式返回的列只是相应数据的视图而已，并不是副本。因此，
对返回的Series所做的任何就地修改全都会反映到源DataFrame上。通过Series
的copy方法即可指定复制列

另一种常见的数据形式是嵌套字典

In [43]:
pop = {'Nevada':{2001:2.4, 2002:2.9},
      'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
"""如果嵌套字典传给DataFrame，pandas就会被解释为：外层字典的键作为列，内
层键则作为行索引"""
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
#你也可以使用类似NumPy数组的方法，对DataFrame进行转置（交换行和列）
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [49]:
#如果设置了DataFrame的index和columns的name属性，则这些信息也会被显示出来
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [50]:
#跟Series一样，values属性也会以二维ndarray的形式返回DataFrame中的数据
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [51]:
#如果DataFrame各列的数据类型不同，则值数组的dtype就会选用能兼容所有列的数据类型
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

索引对象

In [4]:
"""pandas的索引对象负责管理轴标签和其他元数据（比如轴名称等）。构建Series
或DataFrame时，所用到的任何数组或其他序列的标签都会被转换成一个Index"""
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [5]:
index[1:]

Index(['b', 'c'], dtype='object')

In [6]:
#Index对象是不可变的，因此用户不能对其进行修改
#不可变可以使Index对象在多个数据结构之间安全共享
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [7]:
obj2 = pd.Series([1.5,-2.5,0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [8]:
obj2.index is labels

True

#### 基本功能

重新索引

In [9]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [10]:
#pandas对象的一个重要方法是reindex，其作用是创建一个新对象，它的数据符合新的索引
#用该Series的reindex将会根据新索引进行重排。如果某个索引值当前不存在，就引入缺失值
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [11]:
"""对于时间序列这样的有序数据，重新索引时可能需要做一些插值处理。method选
项即可达到此目的，例如，使用ffill可以实现前向值填充"""
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [15]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [16]:
obj31 = obj3.reindex(range(6), method='ffill') #obj3是没有变化的，要赋值给新的变量
obj31

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [17]:
#借助DataFrame，reindex可以修改（行）索引和列。只传递一个序列时，会重新索引结果的行
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a', 'c', 'd'], columns=['Ohio', 'Texas',
'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [18]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [20]:
#列可以用columns关键字重新索引
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [21]:
#丢弃某条轴上的一个或多个项很简单，只要有一个索引数组或列表即可
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [22]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [24]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [43]:
#对于DataFrame，可以删除任意轴上的索引值
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'NewYork'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [27]:
#用标签序列调用drop会从行标签（axis 0）删除值
data.drop(['Colorado', 'Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYork   12   13     14    15

In [28]:
#通过传递axis=1或axis='columns'可以删除列的值
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [31]:
#许多函数，如drop，会修改Series或DataFrame的大小或形状，可以就地修改对象，不会返回新的对象
data.drop(['two', 'four'], axis='columns') #此方法和上面的方法都没有就地修改，而是返回一个新的对象

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NewYork    12     14

In [32]:
#就地修改对象
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

索引、选取和过滤

In [34]:
#Series索引（obj[...]）的工作方式类似于NumPy数组的索引，只不过Series的索引值不只是整数
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [35]:
obj['a']

0.0

In [36]:
obj[1]

1.0

In [37]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [38]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [39]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [40]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [41]:
#利用标签的切片运算与普通的Python切片运算不同，其末端是包含的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [42]:
#用切片可以对Series的相应部分进行设置
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [45]:
#用一个值或序列对DataFrame进行索引其实就是获取一个或多个列
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'NewYork'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [46]:
data['two']

Ohio         1
Colorado     5
Utah         9
NewYork     13
Name: two, dtype: int32

In [47]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
NewYork      14   12

In [55]:
#首先通过切片或布尔型数组选取数据
#选取行的语法data[:2]十分方便。向[ ]传递单一的元素或列表，就可选择列。
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [58]:
#另一种用法是通过布尔型DataFrame
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NewYork   False  False  False  False

In [61]:
data[data < 5] = 0 #这使得DataFrame的语法与NumPy二维数组的语法很像
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

#### 用loc和iloc进行选取

对于DataFrame的行的标签索引，我引入了特殊的标签运算符loc和iloc。

In [68]:
#它们可以让你用类似NumPy的标记，使用轴标签（loc）或整数索引（iloc）
data.loc['Colorado', ['two', 'three']] #轴标签

two      5
three    6
Name: Colorado, dtype: int32

In [64]:
#整数索引iloc
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [69]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [71]:
#这两个索引函数也适用于一个标签或多个标签的切片
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [72]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
NewYork    12   13     14

In [3]:
ser = pd.Series(np.arange(3.))
ser[-1] #pandas报错,这里整数索引报错，分不清index还是数据

KeyError: -1

In [4]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [2]:
#对于非整数索引，不会产生歧义
ser2 = pd.Series(np.arange(3), index=['a', 'b', 'c'])
ser2[-1]

2

In [5]:
#为了进行统一，如果轴索引含有整数，数据选取总会使用标签。为了更准确，请使用loc（标签）或iloc（整数）
ser[:1]

0    0.0
dtype: float64

In [6]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [7]:
ser.iloc[:1]

0    0.0
dtype: float64

算术运算和数据对齐

In [8]:
"""pandas最重要的一个功能是，它可以对不同索引的对象进行算术运算。在将对象
相加时，如果存在不同的索引对，则结果的索引就是该索引对的并集。对于有数据
库经验的用户，这就像在索引标签上进行自动外连接。"""
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [9]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [10]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [23]:
#对于DataFrame，对齐操作会同时发生在行和列上
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), 
                   columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [15]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [16]:
#把它们相加后将会返回一个新的DataFrame，其索引和列为原来那两个DataFrame的并集
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [19]:
#如果DataFrame对象相加，没有共用的列或行标签，结果都会是空
df1 = pd.DataFrame({'A': [1,2]})
df2 = pd.DataFrame({'B': [3,4]})
df1

   A
0  1
1  2

In [20]:
df2

   B
0  3
1  4

In [21]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

在算术方法中填充值
<br>在对不同索引的对象进行算术运算时，你可能希望当一个对象中某个轴标签在另一个对象中找不到时填充一个特殊值（比如0）

In [24]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [25]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [27]:
df1 + df2 #将它们相加时，没有重叠的位置就会产生NA值

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [28]:
#使用df1的add方法，传入df2以及一个fill_value参数
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [29]:
"""Series和DataFrame的算术方法。它们每个都有一个副本，以字母r开
头，它会翻转参数。因此这两个语句是等价的"""
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [30]:
#相当于1除df1,反转了参数
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [31]:
#与此类似，在对Series或DataFrame重新索引时，也可以指定一个填充值
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

DataFrame和Series之间的运算

In [46]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), 
                     columns=list('bde'), 
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [47]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [48]:
#默认情况下，DataFrame和Series之间的算术运算会将Series的索引匹配到DataFrame的列，然后沿着行一直向下广播
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [50]:
#如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [51]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [52]:
#如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [54]:
#如果你希望匹配行且在列上广播，则必须使用算术运算方法
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [55]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [60]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

函数应用和映射

In [61]:
#NumPy的ufuncs（元素级数组方法）也可用于操作pandas对象
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), #也可以不用list函数直接用列表
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.391509 -0.312436 -1.210758
Ohio    0.746481  1.905341  0.167237
Texas  -3.197938 -0.545413  0.649300
Oregon  0.112562 -0.773181  1.252425

In [62]:
np.abs(frame)

               b         d         e
Utah    0.391509  0.312436  1.210758
Ohio    0.746481  1.905341  0.167237
Texas   3.197938  0.545413  0.649300
Oregon  0.112562  0.773181  1.252425

In [63]:
f = lambda x: x.max() - x.min()
frame.apply(f)
"""这里的函数f，计算了一个Series的最大值和最小值的差，在frame的每列都执行了
一次。结果是一个Series，使用frame的列作为索引"""

b    3.944419
d    2.678522
e    2.463183
dtype: float64

In [64]:
#如果传递axis='columns'到apply，这个函数会在每行执行
frame.apply(f, axis='columns')

Utah      0.898322
Ohio      1.738104
Texas     3.847239
Oregon    2.025606
dtype: float64

In [67]:
#传递到apply的函数不是必须返回一个标量，还可以返回由多个值组成的Series
def f(x):
    return pd.Series([x.max(), x.min()], index=['man', 'min'])
frame.apply(f)

            b         d         e
man  0.746481  1.905341  1.252425
min -3.197938 -0.773181 -1.210758

In [68]:
#元素级的Python函数也是可以用的。假如你想得到frame中各个浮点值的格式化字符串，使用applymap即可
format = lambda x: '%0.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.39  -0.31  -1.21
Ohio     0.75   1.91   0.17
Texas   -3.20  -0.55   0.65
Oregon   0.11  -0.77   1.25

In [69]:
#之所以叫做applymap，是因为Series有一个用于应用元素级函数的map方法
frame['e'].map(format)

Utah      -1.21
Ohio       0.17
Texas      0.65
Oregon     1.25
Name: e, dtype: object

排序和排名

In [70]:
#根据条件对数据集排序（sorting）也是一种重要的内置运算
#要对行或列索引进行排序（按字典顺序），可使用sort_index方法，它将返回一个已排序的新对象
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [74]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [76]:
#对于DataFrame，则可以根据任意一个轴上的索引进行排序
frame = pd.DataFrame(np.arange(8).reshape((2,4)), 
                     index=['three', 'one'], 
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [77]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [78]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [79]:
#数据默认是按升序排序的，但也可以降序排序
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [80]:
#若要按值对Series进行排序，可使用其sort_values方法
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [81]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [82]:
#在排序时，任何缺失值默认都会被放到Series的末尾
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [83]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [84]:
"""当排序一个DataFrame时，你可能希望根据一个或多个列中的值进行排序。将一
个或多个列的名字传递给sort_values的by选项即可达到该目的"""
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [85]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [89]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [91]:
#接下来介绍Series和DataFrame的rank方法。
#默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系的
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [92]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

带有重复标签的轴索引

In [93]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [94]:
#索引的is_unique属性可以告诉你它的值是否是唯一的
obj.index.is_unique

False

In [95]:
#如果某个索引对应多个值，则返回一个Series；而对应单个值的，则返回一个标量值
obj['a']

a    0
a    1
dtype: int64

In [96]:
obj['c']

4

In [97]:
#对DataFrame的行进行索引时也是如此
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -2.003659  1.081937 -0.027879
a -0.088491 -0.982778  1.083802
b -0.153086  1.005120  2.182617
b -0.256749 -1.493591 -0.332599

In [98]:
df.loc['b']

          0         1         2
b -0.153086  1.005120  2.182617
b -0.256749 -1.493591 -0.332599

#### 汇总和计算描述统计

In [99]:
"""pandas对象拥有一组常用的数学和统计方法。它们大部分都属于约简和汇总统
计，用于从Series中提取单个值（如sum或mean）或从DataFrame的行或列中提
取一个Series。跟对应的NumPy数组方法相比，它们都是基于没有缺失数据的假
设而构建的。看一个简单的DataFrame"""
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
                  index=['a', 'b', 'c', 'd'], 
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [100]:
#调用DataFrame的sum方法将会返回一个含有列的和的Series
df.sum()

one    9.25
two   -5.80
dtype: float64

In [101]:
#传入axis='columns'或axis=1将会按行进行求和运算
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [102]:
#NA值会自动被排除，除非整个切片（这里指的是行或列）都是NA。通过skipna选项可以禁用该功能
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [103]:
#有些方法（如idxmin和idxmax）返回的是间接统计（比如达到最小值或最大值的索引）
df.idxmax()

one    b
two    d
dtype: object

In [104]:
#累计型，样本值累计和
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [105]:
#还有一种方法，它既不是约简型也不是累计型。describe就是一个例子，它用于一次性产生多个汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [107]:
#还有一种方法，它既不是约简型也不是累计型。describe就是一个例子，它用于一次性产生多个汇总统计
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

相关系数与协方差

In [108]:
import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [109]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-03-04  0.005029 -0.005532 -0.002399  0.005969
2019-03-05 -0.001820 -0.003973 -0.004988  0.012398
2019-03-06 -0.005754 -0.006527  0.000448 -0.003589
2019-03-07 -0.011575 -0.011827 -0.012170 -0.012575
2019-03-08  0.002377 -0.001995  0.001087 -0.000857

In [115]:
#Series的corr方法用于计算两个Series中重叠的、非NA的、按索引对齐的值的相关系数。与此类似，cov用于计算协方差
returns['MSFT'].corr(returns['IBM'])

0.4868899197719678

In [117]:
returns['MSFT'].cov(returns['IBM'])

8.724446816555406e-05

In [118]:
#因为MSTF是一个合理的Python属性，我们还可以用更简洁的语法选择列
returns.MSFT.corr(returns.IBM)

0.4868899197719678

In [119]:
#DataFrame的corr和cov方法将以DataFrame的形式分别返回完整的相关系数或协方差矩阵
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.372275  0.450374  0.457556
IBM   0.372275  1.000000  0.486890  0.408303
MSFT  0.450374  0.486890  1.000000  0.537389
GOOG  0.457556  0.408303  0.537389  1.000000

In [124]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000270  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000078
MSFT  0.000107  0.000087  0.000211  0.000120
GOOG  0.000116  0.000078  0.000120  0.000238

In [125]:
#利用DataFrame的corrwith方法，你可以计算其列或行跟另一个Series或DataFrame之间的相关系数
#传入一个Series将会返回一个相关系数值Series（针对各列进行计算）
returns.corrwith(returns.IBM)

AAPL    0.372275
IBM     1.000000
MSFT    0.486890
GOOG    0.408303
dtype: float64

In [126]:
#传入一个DataFrame则会计算按列名配对的相关系数。
returns.corrwith(volume)
#传入axis='columns'即可按行进行计算。无论如何，在计算相关系数之前，所有的数据项都会按标签对齐

AAPL   -0.059229
IBM    -0.152743
MSFT   -0.089084
GOOG   -0.017261
dtype: float64

唯一值、值计数以及成员资格

In [127]:
#还有一类方法可以从一维Series的值中抽取信息
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [129]:
#第一个函数是unique，它可以得到Series中的唯一值数组
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [130]:
#value_counts用于计算一个Series中各值出现的频率
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [131]:
#value_counts还是一个顶级pandas方法，可用于任何数组或序列
pd.value_counts(obj.values, sort=False)

b    2
a    3
d    1
c    3
dtype: int64

In [132]:
#isin用于判断矢量化集合的成员资格，可用于过滤Series中或DataFrame列中数据的子集
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [133]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [134]:
obj[mask] #用mask的结果来过滤

0    c
5    b
6    b
7    c
8    c
dtype: object